Examinator/src/Catalogs/ПрограммныеПродуктыСУЗ/ПрограммныеПродуктыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммныеПродуктыСУЗ</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыУчебныхПрограммныхПродуктовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/УчебныеБазыСУЗ/УчебныеБазыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчебныеБазыСУЗ</name>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыУчебныхПрограммныхПродуктовСУЗ/ТипыУчебныхПрограммныхПродуктовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхПрограммныхПродуктовСУЗ</name>
  <enumValues>
    <name>УчебнаяБаза1С</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПрограммныеПродуктыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ОписаниеОбработки(Обработка=Неопределено, Поставщик=Неопределено) Экспорт
	
	ОписаниеОбработки = Новый Структура("Безопасно, ВерсияAPI, Данные, Имя", Истина, 1, Неопределено, "");

	Если Обработка <> Неопределено Тогда
	
		Если ТипЗнч(Обработка) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
			
			ОписаниеОбработки.Данные     = Base64Строка(ОбъектыСУЗ.ПолучитьДанные(Обработка, "ДвоичныеДанные", Истина, "ДвоичныеДанные", Поставщик));
			ОписаниеОбработки.Безопасно  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Обработка, "ОткрыватьОбработкуБезопасно");
			
		Иначе
			
			ОписаниеОбработки.Имя = Обработка;
			
		КонецЕсли;

	КонецЕсли;
		
	Возврат ОписаниеОбработки;
	
КонецФункции

Функция ОбработатьОтветПользователя(ДанныеДляОбработки, ПрограммныйПродукт, Пользователь) Экспорт
	
	РезультатОбработки = Новый Структура("Код, Текст", 0, "");
	
	ДанныеПП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрограммныйПродукт, "Обработка, Тип");
	
	Если ДанныеПП.Тип = Перечисления.ТипыУчебныхПрограммныхПродуктовСУЗ.УчебнаяБаза1С Тогда
		
		// Получаем параметры подключения к учебной базе
					
		НастройкиПодключения = РегистрыСведений.УчебныеБазыСУЗ.НастройкиПодключения(ПрограммныйПродукт, Пользователь);
		
		// Соединяемся с внешней базой
		
		Если НастройкиПодключения = Неопределено Тогда
			
			РезультатОбработки.Вставить("Код", 9); 
			РезультатОбработки.Вставить("Форма", Новый Структура("Имя, Ключ, ЗначенияЗаполнения", "РегистрСведений.УчебныеБазыСУЗ.ФормаЗаписи", Неопределено, Новый Структура("Конфигурация, Пользователь", ПрограммныйПродукт, Пользователь)));
			
			Возврат РезультатОбработки;
			
		Иначе
			
			ДанныеДляОбработки.Вставить("НастройкиПодключения", НастройкиПодключения);
			
			ДанныеДляОбработкиXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеДляОбработки);
			
			РезультатСоединения = РегистрыСведений.УчебныеБазыСУЗ.УстановитьПодключение(ДанныеДляОбработкиXML, НастройкиПодключения);
			
			ДанныеДляОбработки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеДляОбработкиXML);
			
		КонецЕсли;
		
		Если РезультатСоединения.ОшибкаПодключения Тогда
			
			КлючНастроек = РегистрыСведений.УчебныеБазыСУЗ.СоздатьКлючЗаписи(Новый Структура("Конфигурация, Пользователь", ПрограммныйПродукт, Пользователь));
			
			РезультатОбработки.Вставить("Код", 10); 
			РезультатОбработки.Вставить("Текст", РезультатСоединения.КраткоеОписаниеОшибки);
			РезультатОбработки.Вставить("Форма", Новый Структура("Имя, Ключ, ЗначенияЗаполнения", "РегистрСведений.УчебныеБазыСУЗ.ФормаЗаписи", КлючНастроек, Неопределено));
			
			Возврат РезультатОбработки;
			
		КонецЕсли;
			
		Если РезультатСоединения.ОшибкаПроверки Тогда
			
			РезультатОбработки.Вставить("Код", 11); 
			РезультатОбработки.Вставить("Текст", РезультатСоединения.КраткоеОписаниеОшибки);
		
		КонецЕсли;
		
	Иначе
		
		РезультатОбработки.Вставить("Код", 12); 
		РезультатОбработки.Вставить("Текст", НСтр("ru = 'Тип учебного программного продукта не задан или не поддерживается'")); 
		
		Возврат РезультатОбработки;
		
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецЕсли
